<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bb4d46fabe5ea312f3f37e5108f46dbec6b9c8e2fac373432748840f73ef6e60","plan_job_ref":"Job PR on main #29 at https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9047146498","plan_out_hash":"c481b984d929f278ef6122054583da4f5136df74d2dab40648eba83c75825129","plan_hash":"20f6429b6c4fcd2ff6abcceaf67f6740caf26af41a659d8633308ebddf13aee6","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __apps/platform/terraform/__
With backend config files: `apps/platform/terraform/backends/prod.s3.tfbackend`
With var files: `apps/platform/terraform/vars/prod.tfvars`
<details>
<summary>Plan: 4 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs-web-app.module.ecs_alb_service_task.aws_ecs_service.ignore_changes_task_definition[0] must be replaced
-/+ resource "aws_ecs_service" "ignore_changes_task_definition" {
!~      health_check_grace_period_seconds  = 1000000000 -> 0
!~      iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" # forces replacement -> (known after apply) # forces replacement
!~      id                                 = "*****************************************************************************************************" -> (known after apply)
+       launch_type                        = (known after apply)
        name                               = "softkit-nestjs-boilerplate-prod-platform"
+       platform_version                   = (known after apply)
-       propagate_tags                     = "NONE" -> null
        tags                               = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
!~      task_definition                    = "softkit-nestjs-boilerplate-prod-platform:13" -> (known after apply)
!~      triggers                           = {} -> (known after apply)
#        (10 unchanged attributes hidden)

!~      deployment_circuit_breaker {
!~          enable   = false -> true
!~          rollback = false -> true
        }

-       network_configuration {
-           assign_public_ip = false -> null
-           security_groups  = [
-               "sg-0fc62532c5abd65de",
            ] -> null
-           subnets          = [
-               "subnet-07e6bec5d71232c5d",
-               "subnet-0acf1e302af6945ce",
-               "subnet-0f8ff92935c478a73",
            ] -> null
        }

#        (3 unchanged blocks hidden)
    }

  # module.ecs-web-app.module.ecs_alb_service_task.aws_ecs_task_definition.default[0] must be replaced
-/+ resource "aws_ecs_task_definition" "default" {
!~      arn                      = "arn:aws:ecs:eu-central-1:381491873946:task-definition/softkit-nestjs-boilerplate-prod-platform:10" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:381491873946:task-definition/softkit-nestjs-boilerplate-prod-platform" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      id                       = "****************************************" -> (known after apply)
!~      network_mode             = "awsvpc" -> (known after apply)
!~      revision                 = 10 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
#        (10 unchanged attributes hidden)
    }

  # module.ecs-web-app.module.ecs_alb_service_task.aws_iam_role.ecs_service[0] will be created
+   resource "aws_iam_role" "ecs_service" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ecs.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "softkit-nestjs-boilerplate-prod-platform-service"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       role_last_used        = (known after apply)
+       tags                  = {
+           "Attributes"  = "service"
+           "Environment" = "prod"
+           "Name"        = "softkit-nestjs-boilerplate-prod-platform-service"
+           "Namespace"   = "softkit-nestjs-boilerplate"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }
+       tags_all              = {
+           "Attributes"  = "service"
+           "Environment" = "prod"
+           "Name"        = "softkit-nestjs-boilerplate-prod-platform-service"
+           "Namespace"   = "softkit-nestjs-boilerplate"
+           "Project"     = "platform"
+           "Repository"  = "softkit-nestjs-boilerplate"
        }
+       unique_id             = (known after apply)
    }

  # module.ecs-web-app.module.ecs_alb_service_task.aws_iam_role_policy.ecs_service[0] will be created
+   resource "aws_iam_role_policy" "ecs_service" {
+       id     = (known after apply)
+       name   = "softkit-nestjs-boilerplate-prod-platform-service"
+       policy = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "elasticloadbalancing:RegisterTargets",
+                           "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
+                           "elasticloadbalancing:Describe*",
+                           "elasticloadbalancing:DeregisterTargets",
+                           "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
+                           "ec2:Describe*",
+                           "ec2:AuthorizeSecurityGroupIngress",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       role   = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.ecs-web-app.module.ecs_codepipeline.module.codebuild.aws_s3_bucket.cache_bucket,
  on /tmp/terraform-data-dir/modules/ecs-web-app.ecs_codepipeline.codebuild/main.tf line 11, in resource "aws_s3_bucket" "cache_bucket":
  11:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR on main #29](https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9047146498)